<template>
  <div class="main">
      <h1 class="main__title">Алексей Абу</h1>

    <SelfieBlock />

    <div class="main__history">
      <h2 class="main__history__title">История, как я стал разработчиком...</h2>
      <p class="main__history__text">
        {{text}}
      </p>
    </div>

    <div class="main__github">
      <a class="main__github__link" href="https://github.com/AlekseyAbu/ya-prak-test" target="_blank">Ссылка на проект</a>
    </div>

    <div class="main__screencast">
      <video
        height="300"
        width="500"
        controls
      >
        <source src="../assets/video.mp4">
      </video>
      <div class="main__screencast__video"></div>
    </div>
  </div>
</template>

<script>
import SelfieBlock from './SelfieBlock.vue';

export default ({
  data: () => ({
    text: 'С момента появления интернета, я пытался создавать сайты.\n'
      + 'Вначале это были форумы, на конструкторе ucoz. Затем я открыл для себя полноценные конструкторы сайтов, помню первый собранный лендос. Тогда мне казалось, что я хакнул систему и теперь на скорую руку буду крутить сайты. Но реальность немного сложней. Несмотря, что все сайты очень похожи, сайты визитки и интернет-магазины были потолком конструкторов. И чтобы добраться до истины, в покорении сайтов, я познакомился с html-версткой. Для меня это было большой черной дырой, было непонятно абсолютно все. Нужно было читать книги и много тренироваться. А так как я был молод, я задвинул эту идею в ящик и наслаждался играми.\n'
      + '\n'
      + 'Прошло много лет, я закончил школу, учился на последнем курсе в универе. Мой сосед по комнате, очень усиленно учил непонятный для меня тогда фронтенд. Я, помня свою мечту, присоединился к нему. Но надолго нас не хватило, так как студент живет только между сессиями. \n'
      + '\n'
      + 'В начале 20 года, я решил, что наконец-то научиться делать сайты, я думал о своем стартапе. А стартап, прежде чем запустить, нужно сделать. \n'
      + '- Но как что-то сделать? Заплатить деньги? \n'
      + '-  Но у меня нет денег..\n'
      + '- Тогда нужно сделать самому!\n'
      + 'И, не имея особо денег на кармане, я написал на почту Яндекс практикума. Сказал, что у меня нет денег купить у них курс, а рассрочек у них нет. Но я очень хотел учиться. Тогда команда сервиса меня обрадовала, сказали, что они тестируют помесячную оплату и я могу попасть на курс на этих условиях.\n'
      + '\n'
      + 'Радости не было предела! Наконец-то я стану разработчиком, но как всегда в реальности, все было сложнее. \n'
      + 'Это были тяжелые будни учебы, было сложно о очень легко одновременно. Сложно, когда думаешь над решением целый день, а через неделю для тебя это кажется простейшей задачей.\n'
      + '\n'
      + 'И вот в конце, после диплома, я про себя начал называть себя фронтенд разрабочиком. И меня больше не интересовали, стартапы, интернет магазины и лендосы. Мне нравилось идти всю ночь по макету, а утром наслаждаться результатом.',
  }),
  components: {
    SelfieBlock,
  },
});
</script>

<style lang="scss" scoped>
    .main {
      max-width: 1260px;
      width: 100%;
      margin: 0 auto;
      background-color: white;
      border-radius: 20px;
      display: flex;
      flex-direction: column;
        &__github {
            margin: 30px auto;
            &__link {
                color: blue;
                text-decoration: none;
            }
        }
    }
</style>
